tutorials/2DChannels/10_baseCasePimpleV2/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 |                                                   
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox             
   \\    /   O peration     | Website:  https://openfoam.org                    
    \\  /    A nd           | Version:  10                                      
     \\/     M anipulation  |                                                   
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 location 	 "constant"; 
 	 object 	 porosityProperties; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

wall
{
	type		DarcyForchheimer;
	active		yes;
	cellZone	wall;

	DarcyForchheimerCoeffs
	{
		d	(2.000000e+12 2.000000e+12 2.000000e+12);
		dPerm	dPerm	[0 -2 0 0 0 0 0]	(2.000000e+12 2.000000e+12 2.000000e+12);
		f	(0.000000e+00 0.000000e+00 0.000000e+00);

		coordinateSystem
		{
			type		cartesian;
			origin		(0 0 0);
			coordinateRotation
			{
				type	axesRotation;
				e1		(1 0 0);
				e2		(0 0 1);
			}
		}
	}
}
coat
{
	type		DarcyForchheimer;
	active		yes;
	cellZone	coat;

	DarcyForchheimerCoeffs
	{
		d	(2.000000e+12 2.000000e+12 2.000000e+12);
		dPerm	dPerm	[0 -2 0 0 0 0 0]	(2.000000e+12 2.000000e+12 2.000000e+12);
		f	(0.000000e+00 0.000000e+00 0.000000e+00);

		coordinateSystem
		{
			type		cartesian;
			origin		(0 0 0);
			coordinateRotation
			{
				type	axesRotation;
				e1		(1 0 0);
				e2		(0 0 1);
			}
		}
	}
}
// ************************************************************************* //

