tutorials/2DChannels/10_baseCasePimpleV2/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// defaultFieldValues
// (
//     volScalarFieldValue alpha.water 1
//     volScalarFieldValue p_rgh 1e5
//     volScalarFieldValue p 1e5
//     volScalarFieldValue T 300
// );

regions
(
    // sphereToCell
    // {
    //     centre (0.5 0.5 0.5);
    //     radius 0.1;
    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.water 0
    //         volScalarFieldValue p_rgh 1e6
    //         volScalarFieldValue p 1e6
    //         volScalarFieldValue T 578
    //     );
    // }
    boxToCell
    {
        box (0 0 0) (0.1466 0.1466 0.014);
        fieldValues
        (
            volScalarFieldValue coatWallFrac 0
        );
    }
    boxToCell
    {
        box (0 0 0.1145) (0.1466 0.1466 1);
        fieldValues
        (
            volScalarFieldValue coatWallFrac 0
        );
    }
);
